{
	"DownloadPDF": "https://docs.google.com/document/d/18uLG8zxx02zP0__XAoV3hUb82YCKsVxETsQoyAIJRGU/export?format=pdf",
	"PDFSite": "http://www.linkedin.com/in/jonathangorr/resume-2d",
	"Twitter": "https://www.twitter.com/JonathanGorr_",
	"Portfolio": "http://www.jonathangorr.com",
	"LinkedIn": "http://www.linkedin.com/in/jonathangorr",
	"Github": "https://www.github.com/JonathanGorr",
	"MacleodSoundcloud": "https://soundcloud.com/kevin-9-1",
	"DominatingStudios": "http://criticalpointgame.com/index.html",
	"Sparkypants": "https://www.sparkypants.com/",
	"MICA": "https://www.mica.edu/",
	"Phantasma": "http://www.jonathangorr.com/phantasma",
	"Starhopper": "http://www.jonathangorr.com/starhopper",
	"TheWorkshop": "http://www.jonathangorr.com/the-workshop",
	"TheAsylum": "http://www.jonathangorr.com/the-asylum",
	
	"CoverLetters" : [
		{
			"Date": "April 16, 2017",
			"Company": "Playstation",
			"Address": "San Francisco, CA",
			"Position": "Front End Developer",
			"RequisitionID": "",
			"Body": "Dear Sir or Madam,\n\nAs a long-time Playstation fan, I am writing to express my interest in the Front End Developer Internship. I am a game designer interested in establishing myself in the game industry and creating value for Playstation.\n\nI achieved my Bachelor’s in Interactive Arts, by rapidly and collaboratively prototyping pc and mobile games in an agile-based academic environment using game engines like Unity3d and HaxeFlixel. The game design program at my university focused on C# OO and component programming, JS web development, software patterns and systems/mechanics design, game design and interaction-specific design(UI/UX). The program has ignited my passion for creating amazing game experiences.\n\nMy recent 17 months Technical Art employment at the baltimore-based game studio, Sparkypants, has boosted my understanding of the engineering and project management aspect of large games. Here I learned how to create, integrate—that includes updating JSON databases—, and version assets and how to resolve kinks in a asset implementation pipeline by effectively communicating with other artists, engineers and designers on their team.\n\nMy 2 years independent, post-graduation Unity game development experience has trained me to write expert C# code targeted for mobile and pc platforms. I am consequently adapted to shader coding in CG and familiar with optimizing assets, lighting and geometry for Unity games.\n\nPlease feel free to contact me via email or phone call (754)-423-4462 to schedule an interview or to discuss my qualifications in further detail.",
			"slug": "sony",
			"download": "https://docs.google.com/document/d/1IbC0UR1XtkEx5ukaJPlZOSv6YXzNSDq2mHU9ofAz_hU/export?format=pdf",
			"logo": ""
		},
		{
			"Date": "April 16, 2017",
			"Company": "Carbonated",
			"Address": "El Segundo, CA 90245",
			"Position": "Software Engineer",
			"RequisitionID": "",
			"Body": "Dear Sir or Madam,\n\nI am writing to express my interest in the Client Software Engineer opportunity at Carbonated. I am a game designer with 2 years hobby experience looking to accelerate the Racing Rivals title.\n\nI achieved my Bachelor’s in Interactive Arts, by rapidly and collaboratively prototyping pc and mobile games in an agile-based academic environment using game engines like Unity3d and HaxeFlixel. The game design program at my university focused on C# and javascript programming and software design, occasionally shifting gears to focus on game design and interaction design(UI/UX). It has ignited my interest for professional development in a racing-paced mobile gaming studio.\n\nMy recent 17 months Technical Art employment at the baltimore-based game studio, Sparkypants, has fueled my understanding of the engineering and project management aspect of large games. Here I learned how to create, integrate and version assets and how to resolve kinks in a asset implementation pipeline by effectively communicating with other artists, engineers and designers on our team.\n\nMy 2 years independent, post-graduation Unity game development experience has trained me to tune-up and write efficient code for mobile platforms. I am consequently adept at mobile shader coding in CG and familiar with repairing many of the performance-related problems inherent of mobile development with Unity.\n\nPlease feel free to contact me via email or phone call (754)-423-4462 to schedule an interview or to discuss my qualifications in further detail.",
			"slug": "carbonated",
			"download": "https://docs.google.com/document/d/1vJPByJqAJLM7Xt568yDao70USYIoBDd32rar0_AuZiw/export?format=pdf",
			"logo": ""
		},
		{
			"Date": "April 14, 2017",
			"Company": "Mattel",
			"Address": "East Aurora, NY",
			"Position": "Unity Programmer",
			"RequisitionID": "Requisition ID: 170662",
			"Body": "Greetings,\n\nI am very excited to learn of the Unity game programmer opportunity at Mattel. I am a Unity developer looking to create amazing experiences in a professional environment. I would like to acquaint with you my 2 years expertise of the listed Unity3d engineering, prototyping and debugging skills.\n\nThe Game Design program at my university, MICA, consisted of rapidly prototyping small games collaboratively in engines like Unity3d and HaxeFlixel, designed and deployed for PC and Mobile platforms including Android and iOS tablets and phones. The program focused on the interaction, mechanics and systems design of games and interactive experiences as well as it focused on the writing of clean, efficient and well-documented C# and JavaScript code that enforced appropriate software design patterns. My minor, Game Art, was dedicated to 3d art, which has also made me equally adept at creative thinking and object and environmental design. Post-graduation, I have 2 years indie hobby experience producing indie games.\n\nFor 17 past recent months, I have been employed as a Technical Artist at Sparkypants—a Baltimore-based game studio. At Sparkypants I was tasked to create, version and integrate game assets into the proprietary engine, using JSON databases; solve or forecast design implementation problems; and perform gameplay and usability tests for their acclaimed title, DropZone.\n\nWith these skills and work experience in mind, I am confident that I can tackle any challenges this responsibility may present. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me via email or a phone call (754 423 4462).\n\n—\nP.S. Here is a link to my interactive Unity3d resume.\nHere is a link to one of my Unity3d games, Phantasma (github).\n—",
			"slug": "mattel",
			"download": "https://docs.google.com/document/d/1ed7Y-sGrXCeIqt9din4ndsIAgi1spMAtHdcDLgDlfwY/export?format=pdf",
			"logo": ""
		},
		{
			"Date": "April 7, 2017",
			"Company": "SixGen LLC.",
			"Address": "Odenton, MD",
			"Position": "Unity Developer",
			"RequisitionID": "",
			"Body": "Dear Sir or Madam,\n\nI would like to acquaint with you my extensive knowledge of the listed game engineering and world building specialties. \n \n At the Maryland Institute College of Art, I achieved my BA in Interactive Arts, majoring in Game Design and minoring in Game Art. The Game Design program consisted of rapidly prototyping small games in engines like Unity3d and Unreal. The Game Art program was dedicated to learning how to 3d model, animate and rig in 3ds max. It also compelled fluency in a host of Adobe products. Around that time, I interned as an Unreal Engine 3 level designer at Dominating Studios. I was responsible for building a metropolitan level for their multiplayer shooter, Critical Point Incursion. Afterwards, I completed my Unreal Engine 4 project, The Workshop, that is a 3d construction of a house’s basement interior. Post-graduation, I am nearing on 2 years of strong Unity3d engineering and 3d art experience. \n \n Creating, versioning (Perforce), and integrating assets into the proprietary game engine. Solving or forecasting design implementation problems cooperatively with artists, programmers and designers. Seeing as I have a considerable deal of experience creating houses and interiors, I am confident I can perform the needed tasks quickly and with high-quality results. I look forward to speaking with you to discuss the project in greater detail. Please feel free to contact me via email or a phone call (754 423 4462).\n\n —\nP.S. My Sparkypants work is located here: http://www.jonathangorr.com/sparkypants; and my house interior work is located here: http://www.jonathangorr.com/the-workshop. \n—",
			"slug": "sixgen",
			"download": "https://docs.google.com/document/d/1J2TG5aCSZnPRrkxuNhBidRc4l2z5UYqkj-qxHmgcp18/export?format=pdf",
			"logo": "https://s3.amazonaws.com/owler-image/logo/six-gen_owler_20160228_001646_original.png"
		},
		{
			"Date": "April 7, 2017",
			"Company": "EQ Games",
			"Address": "Atlanta, GA",
			"Position": "Jr. Programmer",
			"RequisitionID": "",
			"Body": "Greetings,\n\nI am very excited to learn of the junior/entry level videogame programmer opportunity at EQ Games. I specialize in Unity development and would like to acquaint with you my 2 years extensive knowledge of the listed engineering, game design and C# programming skills. \n \n The Game Design program at MICA consisted of rapidly prototyping small games in engines like Unity3d and HaxeFlixel, designed and deployed for PC and Mobile(Android/iOS) platforms. One major component of the program was dedicated to learning fundamental concepts of game and interaction design. Another component focused on the object-oriented design of game systems and mechanics referencing appropriate software design patterns. Post-graduation, I have now 2 years of expert experience independently developing games in Unity3d. \n \n For 17 past recent months, I have been employed as a Technical Artist at Sparkypants—a Baltimore-based game studio. As Technical artist I was tasked to create, version and integrate game assets into the proprietary engine using JSON databases, solve or forecast design implementation problems and perform gameplay and usability tests for their acclaimed title, DropZone. I learned much about the waterfall software design cycle, efficient project management and collaborative studio development.\n\nWith these skills and work experience in mind, I am confident that I can tackle any challenges this responsibility may present. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me via email or a phone call (754 423 4462).\n\n—\nP.S. Here are some Unity games i’ve made: Phantasma: http://www.jonathangorr.com/phantasma. \n Starhopper: http://www.jonathangorr.com/starhopper. \n —",
			"slug": "eqgames",
			"download": "https://docs.google.com/document/d/1cjDIAH7w1lJvBNoYggHuw3Txgd4Ko-J_lHuqc54ilZk/export?format=pdf",
			"logo": "http://pcgamingwiki.com/images/d/d4/EQ_Games_-_Logo.jpg"
		},
		{
			"Date": "April 7, 2017",
			"Company": "WB Games",
			"Address": "San Francisco, CA",
			"Position": "Software Engineer",
			"RequisitionID": "Requisition ID: 157196BR",
			"Body": "Dear Sir or Madam,\n\nI am very excited to learn of the Software Engineering opportunity at WB Games. I would like to acquaint with you my 2 years expert knowledge of the listed Unity3d engineering, porting and optimization skills.\n\nThe Game Design program at my university consisted of rapidly prototyping small games in engines like Unity3d and HaxeFlixel designed and deployed for PC and Mobile(Android/iOS) platforms. One major component of the program was dedicated to learning fundamental concepts of game and interaction design. Another component was dedicated to the object-oriented design of game systems and mechanics referencing appropriate software design patterns. Post-graduation, I have built messaging systems(event-driven design) and components(modular design) in Unity for independent projects.\n\nFor 17 past recent months, I have been employed as a Technical Artist at Sparkypants—a Baltimore-based game studio. At Sparkypants I was tasked to create, version and integrate game assets into the proprietary engine using JSON databases, solve or forecast design implementation problems and perform gameplay and usability tests for their acclaimed title, DropZone.\n\nWith these skills and work experience in mind, I am confident that I can tackle any challenges this responsibility may present. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me via email or a phone call (754 423 4462).",
			"slug": "wbgames",
			"download": "https://docs.google.com/document/d/1GCHOGOR4K5Dgu4F2jsrU0ANp-nPRNIFu8FkVSSp63QU/export?format=pdf",
			"logo": "https://www.wbplay.com/assets/images/wbgames-mailinglist.jpg"
		},
		{
			"Date": "April 5, 2017",
			"Company": "Age of Learning",
			"Address": "Glendale, CA",
			"Position": "Unity Engineer",
			"RequisitionID": "",
			"Body": "Dear Sir or Madam,\n\nI am very excited to learn of the Software Engineer vacancy at Age of Learning. Interested in exploring the educational application of games, I would like to acquaint with you my extensive knowledge of the listed engineering and design skills.\n\nAt the Maryland Institute College of Art, I achieved my BA in Interactive Arts, majoring in Game Design and minoring in Game Art. The Game Design program consisted of rapidly prototyping small games in engines like Unity3d and HaxeFlixel to be deployed either to PC or Mobile platforms. A major component of the program was dedicated to learning fundamental concepts of game and interaction design. Another focused on the component-based and object-oriented design of game systems and mechanics referencing appropriate GoF software design patterns. Post-graduation, I now have more than 4 years of strong C# programming and Unity3d engineering experience.\n\nFor 17 recent past months I have been employed as a Technical Artist at Sparkypants- a game studio located in Baltimore, MD. The technical art discipline is a combination of art and engineering. My responsibilities here included:\n\n1.Creating, versioning (Perforce), and integrating assets into the proprietary game engine.\n2.Solving or forecasting design implementation problems cooperatively with artists, programmers and designers.\n3.Performing usability tests and playtests then reporting this data for daily production discussions.\nAt Sparkypants I learned a great deal about team communication, the waterfall software design process and project management.\n\nWith these skills and work experience in mind, I am confident that I can tackle any challenges this responsibility may present. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me via email or a phone call (754 423 4462).",
			"slug": "ageoflearning",
			"download": "https://docs.google.com/document/d/14oIwsu7S0JPF9HU7-WPxq7ISVByJBJWREf5_8DMiD8E/export?format=pdf",
			"logo": "http://www.ageoflearning.com/style/images/logo.png"
		},
		{
			"Date": "April 5, 2017",
			"Company": "Science Research Center",
			"Address": "Charleston, SC",
			"Position": "Multimedia Developer",
			"RequisitionID": "Job ID: ISS-7857",
			"Body": "Dear Sir or Madam,\n\nI would like to acquaint with you my extensive knowledge of the listed 3d modeling, unity engineering and interaction design skills, for the 3d Artist - Multimedia Developer position.\n\nAt the Maryland Institute College of Art, I achieved my BA in Interactive Arts, majoring in Game Design and minoring in Game Art. The Game Design program consisted of rapidly prototyping small games in engines like Unity3d and Unreal as well as learning fundamental game and interaction design concepts. This program also focused on the implementation of gameplay systems and mechanics using appropriate GoF software design patterns. Naturally, we were compelled fluency in C# and ActionScript 3 programming. Post-graduation, I now have more than 4 years of strong C# programming and debugging experience. The Game Art program focused on 3d modeling, rigging, texturing and animation in 3d Studio Max and Maya; as well as photography, videography and documentation using a host of Adobe applications.\n\nFor 17 recent past months, I have been employed as a Technical Artist at Sparkypants, a game studio located in Baltimore, Maryland. The technical art role combines 3d generalism with the technical problem-solving skills you would expect from engineering. My responsibilities here included:\n\n1.Creating, versioning (Perforce), and integrating 3d assets into the proprietary game engine -- that included updating a JSON—very similar to XML—database.\n\n2.Solving or forecasting asset implementation problems collaboratively with artists, programmers and designers.\n\n3.Material/shader development in Substance Designer.\n\nAdditionally, at Sparkypants I learned a great deal about team communication, adherence to the Waterfall software design process and project management.\n\nWith these skills and work experience in mind, I am confident that I can conquer any challenges this responsibility may place in my path. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me via email or a phone call (754 423 4462).",
			"slug": "src",
			"download": "https://docs.google.com/document/d/14WpQKAF07bWaAupip-4QWHjY6IIPITx2Zg36QgsTdMA/export?format=pdf",
			"logo": ""
		},
		{
			"Date": "April 2, 2017",
			"Company": "Tallience",
			"Address": "San Antonio, TX",
			"Position": "Game Developer",
			"RequisitionID": "",
			"Body": "Greetings Mr. Tejeda,\n\nI am very excited to learn of the Game Developer vacancy at Tallience. I would like to acquaint with you my extensive knowledge of the listed Unity3d engineering and game design skills.\n\nAt the Maryland Institute College of Art, I achieved my BA in Interactive Arts, majoring in Game Design and minoring in Game Art. The Game Design program consisted of rapidly designing, prototyping and testing small games in engines like Unity3d and Unreal, developed for both desktop and mobile platforms. A major component of the coursework included implementation of gameplay systems and mechanics, using appropriate GoF software design patterns. For some projects, students were educated in the use of HTML and CSS for the development of web-based experiences. Post-graduation, I now have more than 2 years of strong C# programming and Unity3d development experience.\n\nFor 17 recent past months I have been employed as a Technical Artist at Sparkypants- a game studio located in Baltimore, MD. The technical art discipline combines 3d art with engineering. My responsibilities here included:\n\n1.Creating, versioning (Perforce), and integrating assets into the proprietary game engine.\n2.Solving or forecasting design implementation problems in a fast-paced work environment with artists, programmers and designers.\n3.Performing UX tests and playtests then reporting this data for daily production discussions.\n\nAt Sparkypants I learned a great deal about team communication, adherence to the waterfall software development life cycle and project management.\n\nWith these skills and work experience in mind, I am confident that I can tackle any challenges the Game Developer position presents. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me either via email or a phone call (754 423 4462).",
			"slug": "tallience",
			"download": "https://docs.google.com/document/d/1jZQ-KYJ04n6ngBMeaWpbzbppN5nLouOuFEnE7zlWJwY/export?format=pdf",
			"logo": ""
		},
		{
			"Date": "April 2, 2017",
			"Company": "RainDrop",
			"Address": "Salt Lake City, UT",
			"Position": "Unity Developer",
			"RequisitionID": "",
			"Body": "Greetings,\n\nI am very excited to learn of the Unity Developer vacancy at RainDrop. I would like to acquaint with you my extensive knowledge of the listed Unity3d engineering, 3d modeling and game development skills.\n\nAt the Maryland Institute College of Art, I achieved my BA in Interactive Arts, majoring in Game Design and minoring in Game Art. The Game Design program consisted of rapidly prototyping small games in engines like Unity3d and Unreal as well as learning fundamental concepts of game and interaction design. This program also focused on the implementation of gameplay systems and mechanics using appropriate GoF software design patterns. Post-graduation, I now have more than 4 years of strong C# programming and Unity3d development experience. The Game Art program focused on 3d modeling, rigging, animation in 3d Studio Max; as well as texturing, videography and documentation using a host of Adobe applications.\n\nFor 17 recent past months I have been employed as a Technical Artist at Sparkypants- a game studio located in Baltimore, MD. The technical art discipline combines 3d modeling with technical engineering. My responsibilities here included:\n\n1.Generating, versioning (Perforce), and integrating assets into the proprietary game engine.\n2.Solving or forecasting design implementation problems with artists, programmers and designers.\n3.Performing UX tests and playtests then reporting this data for daily production discussions.\n\nAt Sparkypants I learned a great deal about team communication, the “waterfall” software design process and project management.\n\nWith these skills and work experience in mind, I am confident that I can tackle any challenges the Unity Developer position presents. I look forward to speaking with you to discuss my qualifications in detail. Please feel free to contact me either via email or a phone call (754 423 4462).",
			"slug": "raindrop",
			"download": "https://docs.google.com/document/d/1_7LjlwSvKenZ2wANE5m4P4nNxcL8s6cgHNSEMDWcAgs/export?format=pdf",
			"logo": ""
		},
		{
			"Date": "March 31, 2017",
			"Company": "Team 17",
			"Address": "Wakefield, United Kingdom",
			"Position": "Jr Technical Designer",
			"RequisitionID": "",
			"Body": "Greetings,\n\nI am very excited to learn of the Junior Technical Designer vacancy at Team 17. I am confident my education and past work experience have made me highly capable to assume the responsibilities this role assumes.\n\nAt the Maryland Institute College of Art, I achieved my BA in Interactive Arts, majoring in Game Design and minoring in Game Art. The program consisted of rapidly prototyping small games in engines like Unity3d(C#) and Unreal Engine(Blueprint) for mobile and desktop platforms. The program focused on designing novel as well as conventional gameplay systems and mechanics then implementing them using appropriate software design patterns. We were also compelled to properly version-control our projects for collaboration purposes using Git then document them for academic review and portfolio incorporation. Coming from a somewhat holistic creative program, I learned to appreciate the game production process from art, design and programmatic perspectives.\n\nI have been most recently employed as a Technical Artist at Sparkypants LLC., located in Baltimore, Maryland. My responsibility as Technical Artist included:\n\n1.Generating, versioning, and integrating assets into the proprietary game engine.\n2.Solving or forecasting implementation problems with artists, programmers and designers.\n3.Performing UX tests and playtests then reporting this data for daily production discussions.\n\nAt Sparkypants I learned a lot about team communication, the “waterfall” software design process and project management – using apps like Trello and Favro -- to assist in meeting production deadlines and milestones.\n\nI happen to be a long-time fan of the Worms franchise, and I was delighted to have met some rockstars like Grant Kirkhope and Team 17 members at GDC this year at the Xbox party. I’d like to close by congratulating Team 17 and its partner on the reception of Yooka-Laylee and I wish the team luck in all its endeavors. I look forward to meeting with you and discussing my qualifications in detail. Please feel free to contact me either via email or a phone call (754 423 4462).\n\nHere is a link to my current project: http://www.jonathangorr.com/phantasma. The game requires a controller to play. All work was done by me. Code(C#) is provided on github.",
			"slug": "tallience",
			"download": "https://docs.google.com/document/d/17eM1PWilMHqgsbqhJ22zjXw_SThSy2P-raGe4SjXVgU/export?format=pdf",
			"logo": ""
		}
	]
}
